Tekla Open API Reference for Tekla Structures 2025
IMovableRelative Methods
The IMovableRelative type exposes the following members.
Methods
Name | Description
MoveObjectRelative
 Moves the current object using the move vector. The move vector can be calculated as in the following example.
Top
See Also
Reference
IMovableRelative Interface
Tekla.Structures.Drawing Namespace